Revit 2024 API
Subelement.HasParameter Method
 Checks if this subelement have given parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool HasParameter(
	ElementId parameterId
)
Visual Basic
Public Function HasParameter ( _
	parameterId As ElementId _
) As Boolean
Visual C++
public:
bool HasParameter(
	ElementId^ parameterId
)
Parameters
parameterId
Type: Autodesk.Revit.DB.ElementId
 Parameter id.
Return Value
 True if %parameterId% identifies valid parameter of this subelement, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Subelement Class
Autodesk.Revit.DB Namespace